Repository: seif1290/NoorApp-Flutter
Catalog: lib/core/localization/l10n/app_*.arb
Languages: ar

# appName
source: Noor
ar: نور

# onboardingTitle1
source: Read the Holy Quran
ar: اقرأ القرآن الكريم

# onboardingTitle2
source: Listen and Reflect
ar: استمع وتدبر

# onboardingTitle3
source: Begin Your Spiritual Journey
ar: ابدأ رحلتك الروحانية

# onboardingSubtitle1
source: Enjoy recitations of the Holy Quran by the best reciters
ar: استمتع بتلاوة القرآن الكريم بأصوات افضل القراء

# onboardingSubtitle2
source: Listen to Quran recitations anytime, anywhere
ar: تمتع بالاستماع إلى تلاوات القرآن الكريم في أي وقت وأي مكان

# onboardingSubtitle3
source: Make the Quran your daily companion
ar: اجعل القرآن رفيقك اليومى

source: Next
ar: التالى

source: Get Started
ar: ابدأ الآن

source: Skip
ar: تخطى

# homeTitle
source: Holy Quran
ar: القرآن الكريم

# ayah
source: {count} Verses
ar: {count} آية

# noInternetConnection
source: No internet connection. Please check your network.
ar: لا يوجد اتصال بالإنترنت. يرجى التحقق من الشبكة.

# connectionTimeout
source: Connection timed out. Please try again.
ar: انتهت مهلة الاتصال. حاول مرة أخرى.

# receiveTimeout
source: The server took too long to respond. Please try later.
ar: الخادم استغرق وقتاً طويلاً للرد. حاول لاحقاً.

# sendTimeout
source: The request took too long to send. Please try again.
ar: استغرق إرسال الطلب وقتاً طويلاً. حاول مرة أخرى.

# requestCancelled
source: The request was cancelled. Please retry.
ar: تم إلغاء الطلب. يرجى المحاولة مجدداً.

# unauthorisedRequest
source: You are not authorized. Please login again.
ar: غير مصرح لك. يرجى تسجيل الدخول مرة أخرى.

# badRequest
source: Invalid request. Please check your input.
ar: طلب غير صالح. تحقق من بياناتك.

# notFound
source: The requested resource was not found.
ar: المورد المطلوب غير موجود.

# conflict
source: Conflict occurred. Please try again.
ar: حدث تعارض. حاول مرة أخرى.

# internalServerError
source: Internal server error. Please try later.
ar: خطأ في الخادم الداخلي. حاول لاحقاً.

# serviceUnavailable
source: The service is currently unavailable. Try again later.
ar: الخدمة غير متاحة حالياً. حاول لاحقاً.

# unknownError
source: Something went wrong. Please try again.
ar: حدث خطأ ما. حاول مرة أخرى.
